Revit 2027 API
LayoutRuleFixedDistance.JustifyType Property
Get or set the type of justification.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BeamSystemJustifyType JustifyType { get; set; }
Public Property JustifyType As BeamSystemJustifyType
	Get
	Set
public:
property BeamSystemJustifyType JustifyType {
	BeamSystemJustifyType get ();
	void set (BeamSystemJustifyType value);
}
member JustifyType : BeamSystemJustifyType with get, set
Property Value
BeamSystemJustifyType
Remarks
The justifyType passed in must be a valid object.
See Also
Reference
LayoutRuleFixedDistance Class
Autodesk.Revit.DB Namespace